Revit 2027 API
FabricationConfiguration.GetSpecificationAbbreviation Method
 Gets specification abbreviation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetSpecificationAbbreviation(
	int specificationId
)
Public Function GetSpecificationAbbreviation (
	specificationId As Integer
) As String
public:
String^ GetSpecificationAbbreviation(
	int specificationId
)
member GetSpecificationAbbreviation :
        specificationId : int -> string
Parameters
specificationId Int32
 The specification identifier.
Return Value
String
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace